Згідно визначення, простими називають цілі числа, що діляться без остачі тільки на 1 або самі на себе.
Напишіть програму для пошуку простих чисел у заданому діапазоні. Програма має запитати у користувача нижню та верхню межу для пошуку простих чисел, знайти всі прості числа що входять у цей діапазон (включаючи межі), вивести їх у консоль, вивести у консоль повідомлення із вказанням кількості знайдених чисел і завершити роботу.
Приклад виводу програми:
Введіть нижню межу діапазону для пошуку простих чисел: 5
Введіть верхню межу діапазону для пошуку простих чисел: 11
Прості числа:
5
7
11
Знайдено простих чисел: 3
Або, якщо у заданому діапазоні не було простих чисел:
Введіть нижню межу діапазону для пошуку простих чисел: 14
Введіть верхню межу діапазону для пошуку простих чисел: 16
Прості числа:
Знайдено простих чисел: 0